Revit 2026 API

# RoutingCondition Properties

---

The RoutingCondition type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Diameter | The diameter of the segment or fitting specified for the routing condition. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

#### Reference

RoutingCondition Class

Autodesk.Revit.DB Namespace